print('Если беременная самка бегемота массой 800кг родит детеныша массой 40 кг,' +
      '\nно затем съест 20кг корма, то сколько она будет после этого всего весить?')
input('\t\t\t\tPress Ener')
print('800 - 40 + 20 = ', 800-40+20)
print('\nЕсли студент, возвращаясь с успешно сданного экзамена, на радостях \n' +
      'купил каждому из 6 друзей по 3 бутылки пива, то сколько всего бутылок пива \n' +
      'куплено?')
input('\t\t\t\tPress Enter')
print('6 * 3 = ', 6*3)
print('\nЕсли в ресторане вам с приятелями принесли счет на 19 долларов (считая чаевые), \n' +
      'и вы решили скинуться поровону на четверых, то сколько придется с каждого?')
input('\t\t\t\tPress Enter')
print('19 / 4 = ', 19/4)
print('/nЕсли четверо пиратов найдут ларчик, в котором ровно 107 золотых монет, и \n' +
      'решат разделить добычу поровн,то сколько целых монет достанется каждому?')
input('\t\t\t\tPress Enter')
print('107 // 4 = ', 107//4)
print('\nЕсли те же самые четверо пиратор разделят те же 107 монет из ларчика поровну, \n' +
      'то сколько останется ничейных монет?')
input('\t\t\t\tPress Enter')
print('107 % 4 = ', 107%4)
input('n\t\t\tPress Ener to key for exit')

      
      
      
