# арсена героя 2.0
# демонстриурет работу с кортежами
# создадим кортеж с несколькими элементами и выведем его с помощью цикла for 
inventory = ('меч',
             'кольчуга',
             'щит',
             'целебное снадобье')
print('\nИтак, в вашем арсенале: ')
for item in inventory:
    print(item)
input('\nНажмите Enter,чтобы продолжить.')
# найдем длину кортежа
print(f'сейчас в вашем распоряжении {len(inventory)} предмета')
input('\nНажмите Enter,чтобы продолжить.')
# проверка на принадлежность кортежу с помощью in
if 'целебное снадобье' in inventory:
    print('Вы еще поживете и повоюете.')
# вывод одного элемента с определенным индексом
index = int(input('\nВведите индекс одного из предметов арсеснала:  '))
print(f'Под индексом {index} в арсенале находится {inventory[index]}')
# отобразим срез
start = int(input('\nВведите начальный индекс среза: '))
finish = int(input('Введите конечный индекс среза: '))
print(f'Срез inventory [{start}:{finish}] - это', end = ' ')
print(inventory[start:finish])
input('\nНажмите Enter,чтобы продолжить.')
# соединим два кортежа
chest = ('золото','драгоценные камни')
print('\nВы нашли ларец. Вот что в нем есть: ')
print(chest)
print('Вы приобщили содержимое ларца к своему аресналу.')
inventory += chest
print('Теперь в вашем распоряжении: ')
print(inventory)
input('\nPress Enter to exit')
